app/Http/Controllers/StudentController.php

select * from `students` where `students`.`deleted_at` is null order by `created_at` desc
---
    public function index(){
        if(request()->ajax()){
            $data = Student::query();

            return DataTables::of($data)
            ->addIndexColumn()
            ->addColumn('action', function($row){
                return '<form action="' . route('student.destroy', $row['id']) .'" method="POST">
                                    '. csrf_field() .'
                                    '. method_field('delete') .'
                                  <a href="'. route('student.edit', $row['id']) .'" class="btn btn-sm btn-primary">EDIT</a>
                                  <button type="submit" class="btn btn-sm btn-danger" onclick=" return confirm(\'Apakah anda Yakin?\')">HAPUS</button>
                                </form>';
            })
            ->rawColumns(['action'])
            ->make();
        }
        $students = Student::latest()->get();

insert into `students` (`nisn`, `nama_lengkap`, `alamat`, `updated_at`, `created_at`) values ('22302022', 'Muhammad Humaidi', 'Longawang', '2024-08-20 04:09:02', '2024-08-20 04:09:02')
---
    public function store(Request $request) {
        $request->validate([
            'nisn' => 'required|numeric|max_digits:10',
            'nama_lengkap' => 'required|string|max:50',
            'alamat' => 'required'
        ]);

        $data = $request->all();

        Student::create($data);

update `students` set `alamat` = 'Longawang Empire', `students`.`updated_at` = '2024-08-20 04:13:28' where `id` = 150001
---
    public function update(Request $request, Student $student) {
        $request->validate([
            'nisn' => 'required|numeric|max_digits:10',
            'nama_lengkap' => 'required|string|max:50',
            'alamat' => 'required'
        ]);

        $data = $request->all();

        $student->update($data);