app/Http/Controllers/StudentController.php

    public function index(){
        $students = Student::latest()->get();
---
select * from `students` where `students`.`deleted_at` is null order by `created_at` desc